{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 256, "kernel_size": [9, 9], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "filters": 256, "kernel_size": [9, 9], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "primary_capsule_reshape", "class_name": "Reshape", "config": {"name": "primary_capsule_reshape", "trainable": true, "target_shape": [-1, 8]}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "primary_capsule_squash", "class_name": "Lambda", "config": {"name": "primary_capsule_squash", "trainable": true, "function": ["4wIAAAAAAAAAAwAAAAUAAABDAAAAczQAAAB0AGoBdABqAnwAgwF8AWQBZAKNA30CfAB8AhQAZAN8\nAhcAdABqA3wCZAQXAIMBFAAbAFMAKQVOVCkB2glrZWVwX2RpbXPpAQAAAGe7vdfZ33zbPSkE2gJ0\nZtoKcmVkdWNlX3N1bdoGc3F1YXJl2gRzcXJ0KQNaDW91dHB1dF92ZWN0b3LaBGF4aXPaBG5vcm2p\nAHIJAAAA+h48aXB5dGhvbi1pbnB1dC0yLTYzNjBiODlkMWNkZT7aBnNxdWFzaAEAAABzBAAAAAAB\nFgE=\n", [-1], null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["primary_capsule_reshape", 0, 0, {}]]]}, {"name": "digit_capsule", "class_name": "CapsuleLayer", "config": {"name": "digit_capsule", "trainable": true}, "inbound_nodes": [[["primary_capsule_squash", 0, 0, {}]]]}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "masking_layer_1", "class_name": "MaskingLayer", "config": {"name": "masking_layer_1", "trainable": true}, "inbound_nodes": [[["digit_capsule", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["masking_layer_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 784, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "output_capsule", "class_name": "LengthLayer", "config": {"name": "output_capsule", "trainable": true}, "inbound_nodes": [[["digit_capsule", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [28, 28, 1]}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["output_capsule", 0, 0], ["reshape_1", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}